Show / Hide Table of Contents
Interface IAutomation
This interface is used for controlling Idea Statica application from external applictions.
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[ServiceContract]
public interface IAutomation
Properties
Improve this Doc   View Source
ProjectDir
Declaration
string ProjectDir
{
    [OperationContract]
    get;
}
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Status
Declaration
AutomationStatus Status { get; }
Property Value
 Type |  Description
 AutomationStatus
Improve this Doc   View Source
TempWorkingDir
Declaration
string TempWorkingDir
{
    [OperationContract]
    get;
}
Property Value
 Type |  Description
 System.String
Methods
Improve this Doc   View Source
CloseProject()
Close the
Declaration
[OperationContract]
void CloseProject()
Improve this Doc   View Source
NotifyChange()
Declaration
void NotifyChange()
Improve this Doc   View Source
OpenProject(String)
Open fileName
Declaration
[OperationContract]
void OpenProject(string fileName)
Parameters
 Type |  Name |  Description
 System.String |  fileName
Project to open
Improve this Doc   View Source
Refresh()
Declaration
[OperationContract]
void Refresh()
Improve this Doc   View Source
RefreshProject()
Refresh the currently open project
Declaration
[OperationContract]
void RefreshProject()
Improve this Doc   View Source
SelectItem(String)
Select item with itemId in the project
Declaration
[OperationContract]
void SelectItem(string itemId)
Parameters
 Type |  Name |  Description
 System.String |  itemId
The identifier of the requested item
Improve this Doc   View Source
Shutdown()
Declaration
[OperationContract]
void Shutdown()
 Improve this Doc
 View Source